### 辗转相除法
### 两个整数m，n   给出这两个整数的最大公约数
### 1.如果m%n==0,则最大公约数为n
### 2.如果m%n!=0,则最大公约数为n和m%n的最大公约数
### 请看下面解析
### 假设  最大公约数为t  那么  m = a*t，n = b*t   m%n = (a*t)%(b*t) = (a%b)*t 并且  这个值是小于n的  所以这时候  m,n的最大公约数就变成了，n和m%n的最大公约数  最后最终结果为m%n为t  即被除数为最小公倍数
def gcd(m,n):
    '''m>n
    1.如果m%n==0,则最大公约数为n
    2.如果m%n!=0,则最大公约数为n和m%n的最大公约数
    假设  最大公约数为t  那么  m = a*t，n = b*t   m%n = (a*t)%(b*t) = (a%b)*t 并且  这个值是小于n的
    所以这时候  m,n的最大公约数就变成了，n和m%n的最大公约数  最后最终结果为m%n为t  即被除数为最小公倍数
    '''
    while m%n!=0:
        m,n = n,m%n### m%n最终会等于t
    return n
print(gcd(24,18))